print("----Робота із циклами-----")
n = 5
i = 1
while i <= n:
    print("Робимо підтягування - ", i)
    i += 1
    # i = i + 1
    # i++  - оператор інкременту і декременту відстуній в Python
print("--Цикл for дуже схожий на foreach у С#--")

message = "Привіт Україна!"
for c in message: # поділить слова на масив і кожну букву виведе окремо
    print(c)

# Роблю звичайний цикл від 0 до 9
print("====від 0 до 9====")
for i in range(10):
    print(i, end=" ")

print("-- в певних мереж 4 до 12 --")
for i in range(4, 12):
    print(i, end=" ")

i = 1
j = 1
print("\n\nВкладені цикли - Таблиця множення")
while i < 10:
    while j < 10:
        print(i*j, end="\t")
        j += 1
    print("\n")
    j = 1
    i += 1

# break - перервати цикл, continue - провторити цикл

# виводимо цикла на екран лише, ті що ділять на 3 без остаці - від 0 до 20
print("Оператор continue\n")
for i in range(20):
    if i % 3 != 0: # Якщо число не ділиться націло на 3, ми посторюємо операцію
        continue
    print(i, end="\t")

