# Виводимо текст на консоль
print("Привіт хлопці і дівчата :)")

# У Python не використовуються {} як блок коду
# замість цього у python пишуться відступи
# або tab або 4 пробіли
    #print("Не можна ставити tab так просто - це помилка")

print("3+6 = ", 3+6)
# Чутливий до рестру символів - Print - помилка
#Print("Помилка")
'''
    Це багаторядковий коментар
    Для пояснення блоку коду
'''
# На С# є типи даних - int, string, char, ...
print("Як Вас звати: ", end='')
name = input()
print("Привіт " + name + "!")